insert into genre (genre_id, name)
values (1, 'Классическая литература'),
       (2, 'Роман'),
       (3, 'Научная фантастика'),
       (4, 'Фантастика'),
       (5, 'Детектив');

insert into author (author_id, name)
values (1, 'Достоевский Ф.М.'),
       (2, 'Пушкин А.С.'),
       (3, 'Агата Кристи'),
       (4, 'Станислав Лем');

insert into book (book_id, title, author_id, price)
values (1, 'Преступление и наказание', 1, 100),
       (2, 'Дубровский', 2, 200),
       (3, 'Убийство в «Восточном экспрессе»', 3, 300),
       (4, 'Загадка Эндхауза', 3, 400),
       (5, 'Солярис', 4, 500),
       (6, 'Глас Господа', 4, 600),
       (7, 'Идиот', 1, 700);

insert into book_genre (book_id, genre_id)
values (1, 1),
       (1, 2),
       (2, 1),
       (2, 2),
       (6, 2),
       (6, 3),
       (5, 2),
       (5, 3),
       (3, 5),
       (4, 5),
       (7, 1),
       (7, 2);
